#include<iostream>
using namespace std;


/*********************************************************************************
* 1、二维数组的四种定义方式：
*	(1) 数据类型 数组名 [ 行数 ][ 列数 ];
*	(2) 数据类型 数组名 [ 行数 ][ 列数 ] = { { 数据1, 数据2 } , { 数据3, 数据4} }; √
*	(3) 数据类型 数组名 [ 行数 ][ 列数 ] = { 数据1, 数据2, 数据3, 数据4};
*	(4) 数据类型 数组名 [  ][ 列数 ] = { 数据1, 数据2, 数据3, 数据4};
* 2、二维数组数组名
*	(1) 查看数组所占内存空间
*	(2) 获取二维数组首地址
*********************************************************************************
*/
//int main()
//{
//	////(1) 数据类型 数组名[行数][列数];
//	//int arr[2][2];
//	//arr[0][0] = 1;
//	//arr[0][1] = 2;
//	//arr[1][0] = 3;
//	//arr[1][1] = 4;
//
//	//for (int i = 0; i < 2; i++)
//	//{
//	//	for (int j = 0; j < 2; j++)
//	//	{
//	//		cout << arr[i][j] << endl;
//	//	}
//	//}
//	////(2) 数据类型 数组名[行数][列数] = { { 数据1, 数据2 } , { 数据3, 数据4} }
//	//int arr1[2][2]
//	//{
//	//	{5,6},
//	//	{7,8}
//	//};
//
//	//for (int i = 0; i < 2; i++)
//	//{
//	//	for (int j = 0; j < 2; j++)
//	//	{
//	//		cout << arr1[i][j] << " ";
//	//	}
//	//	cout << endl;
//	//}
//	////(3) 数据类型 数组名[行数][列数] = { 数据1, 数据2, 数据3, 数据4 }
//	//int arr2[2][2] = { 9, 10, 11, 12 };
//	//for (int i = 0; i < 2; i++)
//	//{
//	//	for (int j = 0; j < 2; j++)
//	//	{
//	//		cout << arr2[i][j] << " ";
//	//	}
//	//	cout << endl;
//	//}
//	////(4)数据类型 数组名[][列数] = { 数据1, 数据2, 数据3, 数据4 }
//	//int arr3[][3] = { 1,2,3,4,5,6 };
//	//for (int i = 0; i < 2; i++)
//	//{
//	//	for (int j = 0; j < 3; j++)
//	//	{
//	//		cout << arr3[i][j] << " ";
//	//	}
//	//	cout << endl;
//	//}
//
//	//cout << "二维数组大小： " << sizeof(arr3) << endl;
//	//cout << "二维数组一行大小： " << sizeof(arr3[0]) << endl;
//	//cout << "二维数组一列大小： " << sizeof(arr3[1]) << endl;
//	//cout << "二维数组元素大小： " << sizeof(arr3[0][0]) << endl;
//	//cout << "二维数组行数：" << sizeof(arr3) / sizeof(arr3[0]) << endl;
//	//cout << "二维数组列数：" << sizeof(arr3[0]) / sizeof(arr3[0][0]) << endl;
//
//	//cout << "二维数组的首地址：" << (int)arr3 << endl;
//	//cout << "二维数组第一行的首地址：" << (int)arr3[0] << endl;
//	//cout << "二维数组第二行的首地址：" << (int)arr3[1] << endl;
//	//cout << "二维数组第一个元素的首地址：" << (int)&arr3[0][0] << endl;
//	//cout << "二维数组第2个元素的首地址：" << (int)&arr3[0][1] << endl;
//	//cout << "二维数组第3个元素的首地址：" << (int)&arr3[0][2] << endl;
//	//cout << "二维数组第4个元素的首地址：" << (int)&arr3[1][0] << endl;
//
//	string names[3] = { "张三","李四","王五" };
//	int score[3][3]
//	{
//		{100,100,100},
//		{90,50,100},
//		{60,70,80}
//	};
//
//	for (int i = 0; i < 3; i++)
//	{
//		for (int j = 0; j < 3; j++)
//		{
//			cout << score[i][j] << " ";
//		}
//		cout << endl;
//	}
//
//	cout << "张三的总成绩为：" << score[0][0] + score[0][1] + score[0][2] << endl;
//	cout << "李四的总成绩为：" << score[1][0] + score[1][1] + score[1][2] << endl;
//	cout << "王五的总成绩为：" << score[2][0] + score[2][1] + score[2][2] << endl;
//
//	for (int i = 0; i < 3; i++)
//	{
//		int sum = 0;
//		for (int j = 0; j < 3; j++)
//		{
//			sum += score[i][j];
//		}
//		cout << "第 " << i + 1 << "个人的总分为： " << sum << endl;
//		cout << names[i] << "的总分为： " << sum << endl;
//	}
//
//	system("pause");
//	return 0;
//}