#include<iostream>
using namespace std;

int main()
{
	/*************************************************
	* 1、算法的实现过程
	*	(1) 比较相邻的元素，如果第一个比第二个大，就交换他们两个。
	*	(2) 对每一对相邻元素做同样的工作，执行完毕后，找到第一个最大值。
	*	(3) 重复以上的步骤，每次比较次数-1，直到不需要比较。
	* 2、(1) 排序的总轮数 = 个数 - 1;
	*	 (2) 每一轮对比次数 = 元素个数 - 排序轮数 - 1;
	* 
	**************************************************/

	int arr[] = { 9,3,5,2,1,1,4,6};
	cout << "排序前： ";
	for (int i = 0; i < 8; i++)
	{		 
		cout << arr[i] << " ";
	}
	cout << endl;

	for (int i = 0; i < 8 - 1; i++) //排序的轮数
	{
		for (int j = 0; j < 8 - i - 1; j++) //内层循环的对比
		{
			if (arr[j] > arr[j + 1])
			{
				int temp = 0;
				temp = arr[j];
				arr[j] = arr[j + 1];
				arr[j + 1] = temp;

			}
		}
	}
	cout << "排序后结果:  ";
	for (int i = 0; i < 8; i++)
	{
		cout << arr[i] << "  ";
	}
	cout << endl;
	system("pause");
	return 0;
}